{
  "backend/main.mo": "Motoko actor defining a Testimonial type and providing functions to add, retrieve by ID, and get all testimonials stored in a Map.",
  "feature_evidence.json": "JSON report documenting implemented features including eagle logo replacement, entrance animations, header alignment fixes, and responsive design optimizations with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing detailed summaries of all frontend component files describing their functionality, animations, styling, and responsive behavior.",
  "frontend/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes including colors, borders, and sidebar styling variables.",
  "frontend/index.html": "HTML entry point for the SwiftOps Automation application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component that composes all page sections including navbar, hero, services, stats, integrations, client profiles, AI performance, CTA, contact, footer, and neon cursor effect.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying AI-driven performance metrics with animated counters, testimonial quote, and connected workflow visualization image with animated pulse nodes.",
  "frontend/src/components/ContactSection.tsx": "Contact section rendering glassmorphism cards for name, phone, WhatsApp (with special green glow), Instagram, and email with icons, labels, and clickable links.",
  "frontend/src/components/EagleClickAnimation.tsx": "Implements a multi-stage fullscreen animation overlay featuring an eagle logo with fade, draw, expand, particles, pulse, scale, and fadeout effects triggered by user clicks.",
  "frontend/src/components/EagleLogo.tsx": "Renders an animated eagle logo with neon glow effects, hover interactions, and a one-time entrance animation tracked via sessionStorage.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Displays a grid of three client testimonial cards with profile images, names, positions, and quotes, using intersection observer for fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Renders a call-to-action section with email input form and submit button featuring ripple effects and neon styling.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Displays a comprehensive footer with brand info, link columns (Company, Services, Resources, Legal), social media icons, contact details, and copyright information.",
  "frontend/src/components/HeroSection.tsx": "Hero section with parallax background, animated eagle logo, floating particles, headline text, and CTA buttons that trigger eagle click animations before scrolling to target sections.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a three-step process section with animated cards showing how to connect systems, deploy AI agents, and automate workflows. Uses intersection observer for scroll-triggered animations and includes connecting lines between steps.",
  "frontend/src/components/IntegrationsSection.tsx": "Shows a horizontally scrolling marquee of integration logos (Slack, Google Workspace, etc.) with hover effects. Features an auto-scrolling animation displaying 10+ platform names.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with logo, desktop/mobile menus, and smooth scroll navigation with active section highlighting. Includes eagle click animation on navigation and responsive design with hamburger menu for mobile.",
  "frontend/src/components/NeonCursor.tsx": "Custom cursor effect that displays a neon blue radial gradient following the mouse pointer on desktop devices only. Uses window resize listener to detect desktop viewport.",
  "frontend/src/components/PricingSection.tsx": "Empty file with no content.",
  "frontend/src/components/ServicesSection.tsx": "Grid layout displaying six service cards (AI Agents, Chatbots, Email Automation, etc.) with icons and descriptions. Uses intersection observer for staggered fade-in animations on scroll.",
  "frontend/src/components/StatsSection.tsx": "Displays four animated statistics (tasks automated, integrations, uptime, clients) in a responsive grid. Uses counter animation hook to animate numbers from zero to target values when visible.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook that tracks which section is currently visible in the viewport using IntersectionObserver. Returns the active section ID for navigation highlighting.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor with authentication. Automatically recreates actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a number from 0 to a target value over a specified duration using requestAnimationFrame. Triggered by a boolean flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration. Manages login/logout flow, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that returns a boolean indicating whether a referenced element is intersecting the viewport. Accepts threshold and rootMargin options for IntersectionObserver configuration.",
  "frontend/src/hooks/useParallax.ts": "Custom React hook that returns a parallax offset value based on scroll position, multiplied by a configurable speed factor.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks; currently unused as the website is static with no backend queries.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom React hook that creates a Material Design-style ripple effect on click, dynamically generating and removing a ripple span element.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom neon cyan theme variables, utility classes for neon effects, buttons, text shadows, and animations for a futuristic AI brand aesthetic.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom neon cyan color palette, Orbitron/Inter fonts, border radius variables, and accordion animations for the SwiftOps brand.",
  "project_state.json": "Project metadata tracking SwiftOps AI automation website features, including eagle logo requirements, entrance animations, responsive header fixes, and known layout issues."
}