{
  "backend/main.mo": "Motoko actor defining a testimonial management system with functions to add, retrieve by ID, and list all testimonials stored in a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for the futuristic robotic eagle logo, including image generation, component integration, cinematic activation animations, and hover interactions.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing the SwiftOps Automation website structure, including navbar, hero section, services, stats, integrations, testimonials, contact forms, and various UI effects.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes, spacing, and design tokens for both light and dark themes using the @layer base directive.",
  "frontend/index.html": "HTML entry point for the SwiftOps Automation React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component composing all page sections including navbar, hero, services, stats, integrations, client profiles, AI performance, CTA, contact, footer, and neon cursor effect.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying AI-driven performance metrics with animated counters, testimonial quote, and connected workflow visualization with pulsing node animations.",
  "frontend/src/components/ContactSection.tsx": "Contact section rendering glassmorphism cards for name, phone, WhatsApp, Instagram, and email with special green glow styling for WhatsApp and scroll-triggered animations.",
  "frontend/src/components/EagleClickAnimation.tsx": "Renders a full-screen eagle logo animation overlay with multiple stages (fade, draw, expand, particles, pulse, scale, fadeout) triggered by an isActive prop, completing after ~3.8 seconds.",
  "frontend/src/components/EagleLogo.tsx": "Displays a robotic eagle logo with animated reveal effects on load (3.2s sequence including neon glow, line activation, eye glow, and energy scan) and hover interactions with floating animation.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Renders a grid of three client testimonial cards with profile images, names, positions, and quotes, using intersection observer for fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Displays a final call-to-action section with email input form and submit button, featuring gradient background and ripple effect on button click.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a comprehensive footer with brand info, four columns of navigation links, social media icons, contact details, and copyright notice.",
  "frontend/src/components/HeroSection.tsx": "Hero section with parallax neural network background, animated eagle logo, floating particles, headline text, and two CTA buttons that trigger eagle click animation before scrolling to target sections.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a three-step process section explaining how the automation platform works (Connect, Deploy, Automate) with animated cards and icons that fade in on scroll.",
  "frontend/src/components/IntegrationsSection.tsx": "Shows a horizontally scrolling marquee of integration logos (Slack, Google Workspace, etc.) with hover effects and glass-card styling.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with logo, menu links (Home, Services, Pricing, Contact), active section highlighting, and eagle animation on navigation clicks.",
  "frontend/src/components/NeonCursor.tsx": "Custom cursor component that displays a neon glow effect following the mouse on desktop devices only.",
  "frontend/src/components/PricingSection.tsx": "Empty file placeholder for pricing section component.",
  "frontend/src/components/ServicesSection.tsx": "Grid layout displaying six service offerings (AI Agents, Chatbots, Email Automation, etc.) with icons and descriptions that animate on scroll.",
  "frontend/src/components/StatsSection.tsx": "Displays four animated statistics (Tasks Automated, Integrations, Uptime, Clients) with counter animations triggered by scroll visibility.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file placeholder for testimonials section component.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook that tracks which section is currently visible in the viewport using IntersectionObserver for navigation highlighting.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a number from 0 to a target value over a specified duration using requestAnimationFrame.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that returns whether an element is intersecting the viewport using IntersectionObserver API with configurable threshold and margins.",
  "frontend/src/hooks/useParallax.ts": "Custom React hook that returns a parallax offset value based on scroll position, multiplied by a configurable speed factor.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks; currently empty as no backend queries are needed for the static website.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom React hook that creates a Material Design-style ripple effect on click, spawning and removing a ripple element at the click position.",
  "frontend/src/index.css": "Global CSS file with Tailwind imports, custom CSS variables for theming, neon cyan color utilities, and extensive neon button/text effect classes for the futuristic UI design.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (neon cyan, dark backgrounds), fonts (Orbitron, Inter), border radius variables, and accordion animations.",
  "project_state.json": "Project metadata file documenting the AI automation brand website with futuristic robotic eagle logo, architectural notes, image requirements, and completed features including logo animations and mobile optimizations."
}