{
  "backend/main.mo": "Motoko actor defining a Testimonial type and Map-based storage with functions to add, retrieve by ID, and get all testimonials.",
  "feature_evidence.json": "Feature evidence report documenting a change to increase font size and dimensions of the Gmail contact card in ContactSection.tsx while ensuring single-line email display.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend component files describing their UI elements, animations, and styling features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors, borders, and sidebar styles.",
  "frontend/index.html": "HTML entry point for SwiftOps Automation app with root div, main.tsx script, and embedded Jotform agent script.",
  "frontend/src/App.tsx": "Main React app component rendering Navbar, all page sections (Hero, Services, Stats, HowItWorks, Integrations, EliteClientProfiles, AIPerformance, FinalCTA, Contact), Footer, and NeonCursor.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying AI performance metrics with animated counters, a testimonial quote, and a workflow visualization image with animated pulse nodes.",
  "frontend/src/components/ContactSection.tsx": "Contact section with glassmorphism cards displaying name, phone, WhatsApp (green glow), Instagram, and email with responsive font sizing (text-sm/base/lg), whitespace-nowrap, and ellipsis overflow handling for single-line display.",
  "frontend/src/components/EagleClickAnimation.tsx": "Full-screen eagle logo animation component with staged sequence including fade, draw, expand, particles, pulse, scale, and fadeout effects triggered on CTA button clicks.",
  "frontend/src/components/EagleLogo.tsx": "React component that renders an animated eagle logo with neon glow effects, hover interactions, and a one-time fade-in animation tracked via sessionStorage.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Displays a grid of three client testimonial cards with profile images, names, positions, and quotes, using intersection observer for fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Final call-to-action section with email input form and submit button featuring ripple effects and neon styling.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Footer component with company branding, multi-column link sections, social media icons, contact info, and copyright notice.",
  "frontend/src/components/HeroSection.tsx": "Hero section with parallax background, animated eagle logo, floating particles, headline text, and CTA buttons that trigger eagle click animations and smooth scrolling.",
  "frontend/src/components/HowItWorksSection.tsx": "Three-step process section with icons (Connect, Deploy, Automate) displayed in cards with animated entrance effects and connecting line.",
  "frontend/src/components/IntegrationsSection.tsx": "Displays an infinite horizontal scrolling marquee of integration partner names with hover effects.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with logo, desktop/mobile menus, scroll effects, and animated section navigation using eagle click animations and ripple effects.",
  "frontend/src/components/NeonCursor.tsx": "Custom cursor component that displays a neon glow effect following the mouse position on desktop devices only.",
  "frontend/src/components/PricingSection.tsx": "Empty file for pricing section component (not yet implemented).",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying six service cards (AI Agents, Chatbots, Email Automation, Workflow Automation, Website/App Development) with icons, descriptions, and fade-in animations.",
  "frontend/src/components/StatsSection.tsx": "Statistics section showing four animated counters (tasks automated, integrations, uptime, clients) with neon styling and intersection-based triggering.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file for testimonials section component (not yet implemented).",
  "frontend/src/hooks/useActiveSection.ts": "Hook that tracks which section is currently visible in the viewport using IntersectionObserver to highlight active navigation links.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an ICP backend actor based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Hook that animates a number from 0 to a target value over a specified duration using requestAnimationFrame.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Hook that returns whether a referenced element is currently intersecting the viewport using IntersectionObserver API.",
  "frontend/src/hooks/useParallax.ts": "Hook that calculates parallax scroll offset based on window scroll position and a configurable speed multiplier.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks that would interact with the backend (currently unused).",
  "frontend/src/hooks/useRippleEffect.ts": "Hook that creates a Material Design-style ripple animation effect on click events by dynamically adding and removing DOM elements.",
  "frontend/src/index.css": "Global CSS file that imports fonts (Orbitron, Inter), configures Tailwind CSS, defines CSS custom properties for theming, and provides utility classes for neon/cyberpunk styling including glowing buttons, text effects, and color utilities.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers, mounting to the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (neon-cyan, dark-bg, etc.), font families (Orbitron, Inter), border radius variables, and animations for accordion components with required plugins.",
  "project_state.json": "Project metadata tracking an existing feature to increase Gmail contact card dimensions while preventing email text wrapping, with one pending feature request (AR-1) for the same goal."
}