{
  "backend/main.mo": "Motoko actor that manages testimonials with add, get by ID, and get all operations using a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting five features related to converting the eagle logo to circular shape with neon styling, glow effects, animations, and responsive design.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend component files describing the SwiftOps Automation website sections, styling, and interactive effects.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors, borders, and component styling tokens.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx with viewport meta tags and page title.",
  "frontend/src/App.tsx": "Root React component that assembles the full page layout with navbar, all content sections, footer, and neon cursor effect.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying four animated performance metrics cards, a testimonial quote, and a workflow visualization image with animated pulse nodes.",
  "frontend/src/components/ContactSection.tsx": "Contact section with glassmorphism cards showing name, phone, WhatsApp (with green glow), Instagram, and email with responsive text handling and scroll animations.",
  "frontend/src/components/EagleClickAnimation.tsx": "Renders a full-screen eagle logo animation with multiple stages (fade, draw, expand, particles, pulse, scale, fadeout) triggered by an isActive prop, completing after ~3.8 seconds.",
  "frontend/src/components/EagleLogo.tsx": "Displays a robotic eagle logo in a circular container with animated neon glow effects, breathing animations, and hover interactions; plays a one-time activation animation on first load tracked via sessionStorage.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Displays a grid of three client testimonial cards with profile images, names, positions, and quotes; uses intersection observer for fade-in animations on scroll.",
  "frontend/src/components/FinalCTASection.tsx": "Renders a call-to-action section with a headline, email input form, and submit button with ripple effect for capturing user emails.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a comprehensive footer with brand info, link columns (Company, Services, Resources, Legal), social media icons, contact details, and copyright notice.",
  "frontend/src/components/HeroSection.tsx": "Hero section with parallax background, animated grid, floating particles, eagle logo, headline text, and CTA buttons that trigger the eagle click animation before scrolling to target sections.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a three-step process section explaining how the automation platform works, with animated cards showing Connect, Deploy, and Scale steps using intersection observer for scroll animations.",
  "frontend/src/components/IntegrationsSection.tsx": "Shows a horizontally scrolling marquee of integration logos (Slack, Google Workspace, etc.) with glass-card styling and hover effects.",
  "frontend/src/components/Navbar.tsx": "Main navigation bar with logo, desktop/mobile menus, active section highlighting, and eagle animation on navigation clicks with ripple effects.",
  "frontend/src/components/NeonCursor.tsx": "Custom cursor component that displays a neon glow effect following the mouse on desktop devices only.",
  "frontend/src/components/PricingSection.tsx": "Empty file placeholder for pricing section component.",
  "frontend/src/components/ServicesSection.tsx": "Grid layout displaying six service cards (AI Agents, Chatbots, Email Automation, etc.) with icons, descriptions, and staggered fade-in animations.",
  "frontend/src/components/StatsSection.tsx": "Statistics section showing four animated counters (tasks automated, integrations, uptime, clients) with neon styling and intersection-triggered animations.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file placeholder for testimonials section component.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook that tracks which section is currently visible in the viewport using IntersectionObserver to highlight active navigation links.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages ICP backend actor creation with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a number from 0 to a target value over a specified duration using requestAnimationFrame.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Generic hook that returns whether an element is intersecting the viewport based on configurable threshold and root margin options.",
  "frontend/src/hooks/useParallax.ts": "Custom React hook that tracks scroll position and returns a parallax offset value based on a configurable speed multiplier.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks; currently empty as no backend queries are needed for the static website.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom React hook that creates a Material Design-style ripple effect on click events by dynamically adding and removing a ripple span element.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind configuration, CSS custom properties for theming, neon cyan color utilities, and futuristic button/text effects with glowing animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom neon colors, dark backgrounds, Orbitron/Inter fonts, and accordion animations using tailwindcss-animate and typography plugins.",
  "project_state.json": "Project state file tracking features and requirements, primarily focused on converting the eagle logo to a circular design with neon effects and removing email addresses from the header."
}