{
  "backend/main.mo": "Motoko actor that manages testimonials with add, get by ID, and get all operations using a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting six eagle logo animation features (head-first power-on, neon glow, energy spread, three-layer glow system, light bloom burst, breathing pulse) with high confidence and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, Navbar, EagleLogo, HeroSection, ServicesSection, StatsSection, HowItWorksSection, IntegrationsSection, PricingSection, TestimonialsSection, FinalCTASection, ContactSection, FloatingWhatsAppButton, and Footer with their animation and styling details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tags, SwiftOps Automation title, root div, and scripts for React app and Jotform embed.",
  "frontend/src/App.tsx": "Main app component that conditionally shows IntroAnimation on first session visit, renders all sections with scroll-triggered fade-in animations using useSectionAnimation hook, and includes NeonCursor, Navbar, and Footer.",
  "frontend/src/components/AboutUsSection.tsx": "About section with two-column layout featuring AI automation illustration on left and glassmorphism card on right with company description, feature highlights with check icons, and CTA buttons for consultation and services.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying four AI performance metrics with animated counters, a testimonial quote, and a connected workflow visualization image with animated pulse nodes.",
  "frontend/src/components/animations/ChatBubblesAnimation.tsx": "Animated chat interface showing alternating bot and user messages with typing indicators. Loops through three messages with timed delays.",
  "frontend/src/components/animations/EmailPipelineAnimation.tsx": "Visualizes an email workflow pipeline with four stages (Draft, Send, Deliver, Open) connected by an animated progress line and flowing email icons.",
  "frontend/src/components/animations/MobileDeviceAnimation.tsx": "Renders a floating mobile device mockup with screen content, notch, and home button using CSS animations.",
  "frontend/src/components/animations/NeuralNetworkAnimation.tsx": "Canvas-based animation of a neural network with moving nodes, dynamic connections based on distance, and animated data flow particles between nodes.",
  "frontend/src/components/animations/WebsiteAssemblyAnimation.tsx": "Animated website layout assembly showing header, sidebar, content, and footer components appearing sequentially with slide/scale transitions.",
  "frontend/src/components/animations/WorkflowNodesAnimation.tsx": "Canvas-based workflow diagram animation with four connected nodes (Start, Process, Validate, Complete) and animated flow particles traveling along connections.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (name, phone, WhatsApp, Instagram, email) in a grid of animated glass cards with intersection observer visibility detection and scroll highlight effects.",
  "frontend/src/components/EagleClickAnimation.tsx": "Full-screen overlay animation component that displays an eagle head logo with sequential stages (fade, draw, expand, particles, pulse, scale, fadeout) triggered by an isActive prop.",
  "frontend/src/components/EagleLogo.tsx": "Renders an eagle head logo with circular container, multiple glow layers, hover effects, and a one-time entry animation tracked via sessionStorage.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Displays three client testimonial cards with profile images, names, positions, company types, and quotes in a responsive grid with staggered fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Call-to-action section with email input form and submit button, featuring gradient background and ripple effect on button click.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty component file with no content.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, four columns of links (Company, Services, Resources, Legal), social media icons, and copyright notice with Caffeine.ai attribution.",
  "frontend/src/components/FounderSection.tsx": "Displays a glassmorphic founder profile card for Shaikh Zeeshan with animated background decorations, neon highlights, and hover effects.",
  "frontend/src/components/HeroSection.tsx": "Main hero section with parallax effects, animated neural network background, eagle logo, CTA buttons that trigger eagle click animations, and floating particles.",
  "frontend/src/components/HowItWorksSection.tsx": "Three-step process section with animated cards, connecting lines, and icons explaining system integration, AI agent deployment, and automation scaling.",
  "frontend/src/components/IntegrationsSection.tsx": "Displays a horizontally scrolling marquee of integration logos (Slack, Google, Salesforce, etc.) with animated gradient backgrounds and intersection observer triggers.",
  "frontend/src/components/IntroAnimation.tsx": "Full-screen intro animation component that displays the eagle logo and brand name with fade-in/out phases, pulse rings, and light sweep effects before calling onComplete.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with eagle logo, desktop/mobile menus, scroll-based styling, active section highlighting, and eagle click animations on navigation.",
  "frontend/src/components/NeonCursor.tsx": "Custom neon cursor effect that follows mouse movement on desktop devices with a radial gradient glow.",
  "frontend/src/components/PricingSection.tsx": "Pricing section component (content truncated in provided files).",
  "frontend/src/components/ServiceDetailPanel.tsx": "Modal panel component that displays detailed service information with animations, features, and benefits. Includes a 'Get Started' button that closes the panel and scrolls to the contact section with a highlight effect.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of service cards with hover effects and click handlers that open the ServiceDetailPanel. Uses intersection observer for scroll-based animations.",
  "frontend/src/components/StatsSection.tsx": "Displays four animated statistics (tasks automated, integrations, uptime, clients) in a grid layout with counter animations triggered by scroll visibility.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file with no content.",
  "frontend/src/data/servicesData.ts": "Defines the ServiceData interface and exports an array of six service offerings (AI Agents, AI Chatbots, Email Automation, Workflow Automation, Website Development, App Development) with titles, descriptions, features, icons, and image paths.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook that uses IntersectionObserver to track which section is currently visible in the viewport and returns the active section ID as a hash string.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a counter from 0 to a target number over a specified duration using requestAnimationFrame.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver to detect when a referenced element enters the viewport and returns a boolean intersection state.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that calculates a parallax scroll offset based on window scroll position multiplied by a speed factor.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query backend interaction hooks with a comment noting no backend queries are currently needed.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom hook that creates a Material Design-style ripple effect on button clicks by dynamically creating and animating a span element at the click position.",
  "frontend/src/hooks/useSectionAnimation.ts": "Custom hook using IntersectionObserver to detect when a section enters the viewport and trigger fade-in/translateY animations with optional delay.",
  "frontend/src/hooks/useServicePanel.ts": "Custom hook managing the open/closed state and active service data for a service detail panel with open and close functions.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties, Tailwind layers, neon cyan theme utilities, glass/neon card styles, button styles, animations (grid, particles, floating), and responsive design rules.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider for state management and ICP authentication.",
  "frontend/src/utils/scrollHelpers.ts": "Utility functions for smooth scrolling to elements with offset compensation, triggering highlight effects via custom events, and combined scroll-to-section functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (neon-cyan, electric-blue, dark-bg), font families (Orbitron, Inter), and animation keyframes for accordion components with shadcn/ui theming support.",
  "project_state.json": "Project state tracking document for SwiftOps landing page, documenting seven implemented features focused on GPU-accelerated eagle logo animations with head-first neon energy spread and multi-layer glow effects."
}