{
  "backend/main.mo": "Motoko actor defining a Testimonial type and Map-based storage with functions to add, retrieve by ID, and get all testimonials.",
  "feature_evidence.json": "Feature evidence report documenting implemented button animations, transitions, hover effects, click interactions, GPU optimizations, glow effects, and smooth scrolling with high confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, Navbar, HeroSection, ServicesSection, and various other UI sections with their animations and styling details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors, borders, backgrounds, and other design tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tags, title, root div, and script imports for the React app and Jotform embed.",
  "frontend/src/App.tsx": "Main App component managing intro animation state via sessionStorage, rendering all page sections with fade-in transition after intro completes.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying four AI performance metrics with animated counters, a testimonial quote, and a workflow visualization image with animated pulse nodes.",
  "frontend/src/components/animations/ChatBubblesAnimation.tsx": "Animates a chat conversation sequence with bot and user messages, typing indicators, and auto-looping message display.",
  "frontend/src/components/animations/EmailPipelineAnimation.tsx": "Visualizes an email workflow pipeline with four stages (Draft, Send, Deliver, Open) and animated progress line with flowing email icons.",
  "frontend/src/components/animations/MobileDeviceAnimation.tsx": "Renders a floating animated mobile device mockup with screen content, notch, and home button using CSS animations.",
  "frontend/src/components/animations/NeuralNetworkAnimation.tsx": "Canvas-based animation showing interconnected nodes with flowing data particles, simulating a neural network with dynamic connections.",
  "frontend/src/components/animations/WebsiteAssemblyAnimation.tsx": "Animates the sequential assembly of website components (header, sidebar, content, footer) with staggered transitions that loop continuously.",
  "frontend/src/components/animations/WorkflowNodesAnimation.tsx": "Canvas animation depicting a workflow graph with connected nodes (Start, Process, Validate, Complete) and animated data flow particles.",
  "frontend/src/components/ContactSection.tsx": "Contact section rendering glassmorphism cards for name, phone, WhatsApp, Instagram, and email with icons, hover effects, and special WhatsApp glow styling.",
  "frontend/src/components/EagleClickAnimation.tsx": "Renders a full-screen eagle logo animation sequence with multiple stages (fade, draw, expand, particles, pulse, scale, fadeout) triggered by an isActive prop, completing after ~3.8 seconds.",
  "frontend/src/components/EagleLogo.tsx": "Displays an animated eagle head logo with neon glow effects, hover interactions, and a one-time fade-in animation tracked via sessionStorage.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Renders a grid of three client testimonial cards with profile images, names, positions, and quotes, using intersection observer for fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Displays a call-to-action section with a heading, description, and email input form with a submit button that uses ripple effects.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a footer with brand info, social media icons, four columns of navigation links (Company, Services, Resources, Legal), and copyright information with a Caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero section with parallax background, animated grid, floating particles, large heading text, CTA buttons that trigger eagle animation, and an eagle logo background element.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a three-step process section with animated cards showing how to connect systems, deploy AI agents, and automate workflows. Uses intersection observer for scroll-triggered animations and includes connecting lines between steps.",
  "frontend/src/components/IntegrationsSection.tsx": "Shows an infinite scrolling carousel of integration logos (Slack, Google Workspace, etc.) with animated background gradients. Uses intersection observer to trigger fade-in animations when the section becomes visible.",
  "frontend/src/components/IntroAnimation.tsx": "Full-screen intro animation component that displays the SwiftOps eagle logo with pulsing rings and light sweep effects. Runs through fade-in, animate, and fade-out phases over 3 seconds before calling onComplete callback.",
  "frontend/src/components/Navbar.tsx": "Main navigation bar with logo, desktop/mobile menus, and smooth scroll navigation. Features glass morphism styling on scroll, ripple effects on clicks, and triggers eagle animation when navigating between sections.",
  "frontend/src/components/NeonCursor.tsx": "Custom cursor effect that creates a neon blue radial gradient glow following the mouse pointer. Only renders on desktop devices (min-width: 1024px).",
  "frontend/src/components/PricingSection.tsx": "Empty component file with no content.",
  "frontend/src/components/ServiceDetailPanel.tsx": "Modal panel that displays detailed service information with custom animations for each service type (neural network, chat bubbles, email pipeline, etc.). Includes backdrop blur, close button, and feature lists with benefits.",
  "frontend/src/components/ServicesSection.tsx": "Grid layout displaying service cards with icons, titles, and descriptions. Cards have hover effects with shimmer overlays and open a detail panel when clicked, using intersection observer for staggered fade-in animations.",
  "frontend/src/components/StatsSection.tsx": "Displays animated statistics (tasks automated, integrations, uptime, clients) in a grid layout with counter animations and fade-in effects triggered by intersection observer.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file with no content.",
  "frontend/src/data/servicesData.ts": "Defines service data structure and exports array of six services (AI Agents, Chatbots, Email Automation, Workflow Automation, Website Development, App Development) with descriptions, features, and icons.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook that tracks which section is currently visible in viewport using IntersectionObserver and returns the active section ID.",
  "frontend/src/hooks/useActor.ts": "Manages backend actor creation with Internet Identity authentication, using React Query to cache and invalidate actor instances when identity changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a number from 0 to a target value over a specified duration using requestAnimationFrame.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver API to detect when a referenced element enters the viewport with configurable threshold and root margin.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that calculates parallax scroll offset based on window scroll position and a configurable speed multiplier.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks that would interact with the backend; currently unused for this static website.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom hook that creates Material Design-style ripple effects on button clicks by dynamically generating and animating span elements.",
  "frontend/src/hooks/useServicePanel.ts": "Custom hook managing the open/close state and active service data for a service detail panel with delayed cleanup for exit animations.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties, Tailwind layers, neon-themed color utilities, premium button animations with glow effects, and smooth transitions optimized for 60fps performance.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom neon-themed colors, Orbitron/Inter fonts, border radius variables, and accordion animations with required plugins.",
  "project_state.json": "Project metadata tracking implemented features focused on smooth button animations, transitions, hover effects, mobile optimization, and section entry animations for enhanced UX."
}