{
  "backend/main.mo": "Motoko actor defining a testimonial storage system with functions to add, retrieve by ID, and list all testimonials containing client name, company, feedback, and profile image URL.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: removal of TestimonialsSection and PricingSection components, and creation of EliteClientProfilesSection and AIPerformanceSection components with detailed specifications.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing their functionality, styling, animations, and visual effects for the SwiftOps Automation website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, foregrounds, borders, and component styling using HSL color space.",
  "frontend/index.html": "HTML entry point for the SwiftOps Automation application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component orchestrating the complete page layout with Navbar, Hero, Services, Stats, HowItWorks, Integrations, EliteClientProfiles, AIPerformance, FinalCTA, Contact, Footer sections, and NeonCursor effect.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying AI-driven performance metrics with animated counters for automation rate, processing speed, accuracy, and manual intervention reduction, plus a testimonial quote and connected workflow visualization with animated nodes.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying glassmorphism cards with contact information (name, phone, WhatsApp, Instagram, email) featuring icon-based layout, special green glow for WhatsApp, and scroll-triggered fade-in animations.",
  "frontend/src/components/EagleClickAnimation.tsx": "Renders a full-screen eagle logo animation with multiple stages (fade, draw, expand, particles, pulse, scale, fadeout) triggered by an isActive prop and calls onComplete when finished.",
  "frontend/src/components/EagleLogo.tsx": "Displays the SwiftOps eagle logo with neon glow effects, hover animations, and a pulsing radial background; supports icon/full variants and custom sizing.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Renders a grid of three client testimonial cards with profile images, names, positions, and quotes; uses intersection observer for fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Displays a final call-to-action section with a headline, email input form, and submit button with ripple effect for lead capture.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a comprehensive footer with brand info, link columns (Company, Services, Resources, Legal), social media icons, contact details, and copyright notice.",
  "frontend/src/components/HeroSection.tsx": "Main hero section with parallax neural grid background, animated eagle logo, floating particles, headline text, and CTA buttons that trigger eagle click animation before scrolling to target sections.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a three-step process (Connect, Deploy, Automate) with icons and descriptions in glass cards, connected by an animated energy pulse line on desktop.",
  "frontend/src/components/IntegrationsSection.tsx": "Displays a horizontally scrolling list of integration partners (Slack, Google Workspace, etc.) with animated glass cards and hover effects.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with logo, section links, and active section highlighting; triggers eagle animation on navigation clicks and smooth scrolling.",
  "frontend/src/components/NeonCursor.tsx": "Custom cursor component that displays a neon blue radial gradient glow effect following the mouse on desktop devices only.",
  "frontend/src/components/PricingSection.tsx": "Empty file placeholder for pricing section component.",
  "frontend/src/components/ServicesSection.tsx": "Grid layout displaying six service cards (AI Agents, Chatbots, Email Automation, etc.) with icons, descriptions, and staggered fade-in animations.",
  "frontend/src/components/StatsSection.tsx": "Displays four animated statistics (tasks automated, integrations, uptime, clients) with counter animations triggered on scroll into view.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file placeholder for testimonials section component.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook using IntersectionObserver to track which section is currently visible in the viewport for navigation highlighting.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor with authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a number from 0 to a target value over a specified duration using requestAnimationFrame.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that returns a boolean indicating whether a referenced element is intersecting the viewport based on threshold and margin options.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that calculates and returns a parallax scroll offset based on window scroll position and a speed multiplier.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks that would interact with the backend.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom hook that creates a Material Design-style ripple effect animation at the click position on any element.",
  "frontend/src/index.css": "Global CSS file importing Google Fonts (Orbitron, Inter), Tailwind directives, and defining custom CSS variables, utilities for neon/cyan color scheme, glassmorphism effects, animated buttons with glow effects, and futuristic dark theme styling.",
  "frontend/src/main.tsx": "React application entry point that renders the App component wrapped in QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (neon-cyan, dark-bg, electric-blue), font families (Orbitron, Inter), border radius variables, accordion animations, and enabling tailwindcss-animate and typography plugins.",
  "project_state.json": "Project state tracking document describing a futuristic dark/neon landing page with glassmorphism, animated counters, responsive layouts, and listing completed features including removal of testimonials/pricing sections and addition of elite client profiles and AI performance sections with specific image requirements."
}