{
  "backend/main.mo": "Motoko actor defining a Testimonial type and Map-based storage with functions to add, retrieve by ID, and get all testimonials.",
  "feature_evidence.json": "Feature evidence report documenting three features for replacing static AI section image with animated workflow visualization, adding enterprise-grade animations, and styling with neon futuristic theme.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, Navbar, Hero, Services, Stats, Integrations, Testimonials, Contact, Footer, and animation components with their styling and interaction details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for SwiftOps Automation app with root div, main.tsx module script, and embedded Jotform agent script.",
  "frontend/src/App.tsx": "Main React app component composing all sections (Navbar, Hero, Services, Stats, HowItWorks, Integrations, EliteClientProfiles, AIPerformance, FinalCTA, Contact, Footer) with NeonCursor and TouchGlowEffect.",
  "frontend/src/components/AIPerformanceSection.tsx": "AI Performance Intelligence section displaying four animated metric cards, a testimonial quote, and the AIWorkflowVisualization component with intersection observer animations.",
  "frontend/src/components/animations/AIWorkflowVisualization.tsx": "Canvas-based animation showing an AI hub with connected nodes (CRM, AI Agent, Chatbot, etc.), animated particles flowing between nodes, and floating dashboard panels displaying metrics like uptime and efficiency.",
  "frontend/src/components/animations/ChatBubblesAnimation.tsx": "Animated chat interface that sequentially displays bot and user messages with typing indicators, automatically looping the conversation after completion.",
  "frontend/src/components/animations/EmailPipelineAnimation.tsx": "Visualizes an email pipeline with four stages (Draft, Send, Deliver, Open) connected by an animated progress line and flowing email icons.",
  "frontend/src/components/animations/MobileDeviceAnimation.tsx": "Renders a floating 3D mobile device mockup with a glowing screen showing app interface elements and a pulsing app icon.",
  "frontend/src/components/animations/NeuralNetworkAnimation.tsx": "Canvas animation displaying moving nodes connected by lines with animated data flow particles, simulating a neural network with distance-based connection opacity.",
  "frontend/src/components/animations/WebsiteAssemblyAnimation.tsx": "Animates the sequential assembly of website components (header, sidebar, content, footer) sliding into place with staggered delays, looping continuously.",
  "frontend/src/components/animations/WorkflowNodesAnimation.tsx": "Canvas-based workflow diagram showing connected nodes (Start, Process, Validate, Complete) with animated particles flowing along the connection paths.",
  "frontend/src/components/ContactSection.tsx": "Contact section with glassmorphism cards displaying contact methods (Name, Phone, WhatsApp with green glow, Instagram, Email with responsive text sizing) using intersection observer for fade-in animations.",
  "frontend/src/components/EagleClickAnimation.tsx": "Renders a full-screen eagle logo animation with multiple stages (fade, draw, expand, particles, pulse, scale, fadeout) triggered by an isActive prop, completing after ~3.8 seconds.",
  "frontend/src/components/EagleLogo.tsx": "Displays an eagle head logo in a circular container with neon glow effects, animated pulse, and hover interactions; plays a fade-in animation once per session.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Renders a grid of three client testimonial cards with profile images, names, positions, and quotes; uses intersection observer for fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Displays a call-to-action section with a headline, description, and email input form with a submit button that uses ripple effects.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a comprehensive footer with brand info, link columns (Company, Services, Resources, Legal), social media icons, contact details, and copyright notice.",
  "frontend/src/components/HeroSection.tsx": "Hero section with parallax background, animated grid, floating particles, large eagle logo, headline text, and CTA buttons that trigger eagle click animation before scrolling to target sections.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a three-step process section with animated cards showing how to connect systems, deploy AI agents, and automate workflows. Uses intersection observer for scroll-triggered animations and includes a connecting line with energy pulse effect.",
  "frontend/src/components/IntegrationsSection.tsx": "Renders a horizontally scrolling marquee of integration logos (Slack, Google Workspace, etc.) with glass-card styling and hover effects. Displays 10+ platform names in an infinite auto-scrolling animation.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with logo, desktop/mobile menus, and smooth scroll navigation with active section highlighting. Includes eagle click animation on navigation and ripple effects on interactions.",
  "frontend/src/components/NeonCursor.tsx": "Custom animated cursor with trailing particles, magnetic attraction to interactive elements, and performance-aware rendering. Only displays on desktop devices with fine pointer input and disables on low-performance or battery-saver mode.",
  "frontend/src/components/PricingSection.tsx": "Empty file with no content.",
  "frontend/src/components/ServiceDetailPanel.tsx": "Modal panel displaying detailed service information with animated visualizations specific to each service type (AI agents, chatbots, email automation, etc.). Includes backdrop blur, close button, and grid layout with icon, description, and features.",
  "frontend/src/components/ServicesSection.tsx": "Grid of service cards with hover effects and click handlers to open detailed service panels. Uses intersection observer for scroll animations and displays six services from servicesData with icons and descriptions.",
  "frontend/src/components/StatsSection.tsx": "Displays four animated statistics (tasks automated, integrations, uptime, clients) in a responsive grid. Uses counter animation hook to animate numbers from zero when section becomes visible.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file with no content.",
  "frontend/src/components/TouchGlowEffect.tsx": "Renders touch ripple effects and a floating orb that follows touch movement on mobile devices, with performance detection to disable effects on low-performance or battery-saver mode.",
  "frontend/src/data/servicesData.ts": "Defines the ServiceData interface and exports an array of six service offerings (AI Agents, AI Chatbots, Email Automation, Workflow Automation, Website Development, App Development) with titles, descriptions, features, icons, and image paths.",
  "frontend/src/hooks/useActiveSection.ts": "Custom React hook that uses IntersectionObserver to track which section is currently visible in the viewport and returns the active section ID as a hash string.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a number from 0 to a target value over a specified duration using requestAnimationFrame for smooth counting animations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that wraps IntersectionObserver API to detect when a referenced element enters or exits the viewport with configurable threshold and root margin.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that calculates a parallax offset based on scroll position multiplied by a speed factor for creating parallax scrolling effects.",
  "frontend/src/hooks/usePerformanceDetection.ts": "Detects device performance characteristics by checking CPU cores and battery status to determine if the device is low-performance or in battery saver mode.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query backend interaction hooks; currently empty as no backend queries are needed for the static website.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom hook that creates a Material Design-style ripple effect on button clicks by dynamically creating and animating a span element at the click position.",
  "frontend/src/hooks/useServicePanel.ts": "Manages state for a service detail panel, providing functions to open/close the panel and track the currently active service with delayed cleanup for exit animations.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base styles, CSS custom properties for theming, neon cyan color utilities, glowing button styles, text effects, and various animation keyframes for the futuristic UI design.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom neon colors, Orbitron and Inter fonts, border radius variables, and accordion animations, plus typography and animate plugins.",
  "project_state.json": "Project state configuration tracking 8 features including AI workflow visualization, neon cursor, interactive animations, and responsive design improvements. Defines image requirements, architectural notes about React/TypeScript/Tailwind stack, and known issues with cursor performance and mobile responsiveness."
}