{
  "backend/main.mo": "Motoko actor defining a Testimonial type and Map-based storage with functions to add, retrieve by ID, and get all testimonials.",
  "feature_evidence.json": "Feature evidence report documenting completed navigation fixes, section ID corrections, Projects button removal, eagle logo neon effects, and other UI enhancements with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, Navbar, sections (Hero, Services, Stats, etc.), animations, and utilities with details on functionality and styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, borders, and component styling.",
  "frontend/index.html": "HTML entry point with viewport meta tags, title \"SwiftOps Automation\", root div for React mounting, and Jotform embed script.",
  "frontend/src/App.tsx": "Main React app component managing intro animation state, rendering Navbar and all page sections with scroll-triggered fade-in animations using useSectionAnimation hook.",
  "frontend/src/components/AboutUsSection.tsx": "About section with two-column layout featuring AI illustration, company description, feature highlights with checkmarks, and CTA buttons linking to contact and services sections.",
  "frontend/src/components/AIPerformanceSection.tsx": "Section displaying AI performance metrics (automation rate, processing speed, accuracy, manual intervention reduction) with animated counters, testimonial quote, and connected workflow visualization.",
  "frontend/src/components/animations/ChatBubblesAnimation.tsx": "Animated chat interface showing a conversation sequence with typing indicators and message bubbles. Messages appear sequentially with delays and the animation loops continuously.",
  "frontend/src/components/animations/EmailPipelineAnimation.tsx": "Email workflow visualization showing four pipeline stages (Draft, Send, Deliver, Open) with animated progress line and flowing email icons moving through the pipeline stages.",
  "frontend/src/components/animations/MobileDeviceAnimation.tsx": "3D mobile device mockup with floating animation, displaying a phone with notch, screen content, app icon, and home button with gradient styling and glow effects.",
  "frontend/src/components/animations/NeuralNetworkAnimation.tsx": "Canvas-based neural network visualization with moving nodes connected by lines, showing animated data flow particles traveling between nodes with glow effects.",
  "frontend/src/components/animations/WebsiteAssemblyAnimation.tsx": "Website layout assembly animation showing header, sidebar, content, and footer components appearing sequentially with slide and scale transitions that loop continuously.",
  "frontend/src/components/animations/WorkflowNodesAnimation.tsx": "Canvas-based workflow diagram showing connected nodes (Start, Process, Validate, Complete) with animated particles flowing along connection paths and glowing effects.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (name, phone, WhatsApp, Instagram, email) in animated glass cards with intersection observer and scroll highlight effects.",
  "frontend/src/components/EagleClickAnimation.tsx": "Full-screen eagle logo animation component with multi-stage sequence (fade, draw, expand, particles, pulse, scale, fadeout) triggered by isActive prop.",
  "frontend/src/components/EagleLogo.tsx": "Circular eagle head logo with neon glow effects, hover animations, and one-time entry animation tracked via sessionStorage.",
  "frontend/src/components/EliteClientProfilesSection.tsx": "Displays three client testimonial cards with profile images, positions, and quotes in a responsive grid with fade-in animations.",
  "frontend/src/components/FinalCTASection.tsx": "Call-to-action section with email input form and 'Get Started' button featuring neon styling and ripple effects.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Footer with brand logo, multi-column link sections (Company, Services, Resources, Legal), social media icons, and copyright information with Caffeine.ai attribution.",
  "frontend/src/components/FounderSection.tsx": "Displays a glassmorphic founder profile card for Shaikh Zeeshan with animated background decorations, neon highlights, and hover effects.",
  "frontend/src/components/HeroSection.tsx": "Main hero section with parallax background, animated particles, eagle logo, headline text, and CTA buttons that trigger eagle click animations and scroll to sections.",
  "frontend/src/components/HowItWorksSection.tsx": "Three-step process section with animated cards showing Connect, Deploy, and Automate steps, using intersection observer for fade-in animations.",
  "frontend/src/components/IntegrationsSection.tsx": "Displays an infinite horizontal scrolling carousel of integration logos (Slack, Google, Salesforce, etc.) with animated gradient background and staggered fade-in effects.",
  "frontend/src/components/IntroAnimation.tsx": "Full-screen intro animation component that displays the eagle logo and brand name with fade-in/out phases, pulse rings, and light sweep effects before completing.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with eagle logo, desktop/mobile menus, active section highlighting, scroll effects, and click animations that trigger section scrolling.",
  "frontend/src/components/NeonCursor.tsx": "Custom neon cursor effect that follows mouse movement on desktop devices with a radial gradient glow.",
  "frontend/src/components/PricingSection.tsx": "Pricing section component (content truncated in provided file).",
  "frontend/src/components/ServiceDetailPanel.tsx": "Modal panel component that displays detailed service information with animated visuals, feature lists, and a 'Get Started' button that scrolls to the contact section. Renders different animations based on service ID and includes backdrop blur and close functionality.",
  "frontend/src/components/ServicesSection.tsx": "Services grid section that displays service cards with hover effects and click handlers to open the ServiceDetailPanel. Uses intersection observer for fade-in animations and integrates with the service panel hook.",
  "frontend/src/components/StatsSection.tsx": "Statistics display section showing four key metrics (tasks automated, integrations, uptime, clients) with animated counter effects triggered by intersection observer. Each stat item animates in with staggered delays.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file with no content.",
  "frontend/src/data/servicesData.ts": "Defines the ServiceData interface and exports an array of six service offerings (AI Agents, AI Chatbots, Email Automation, Workflow Automation, Website Development, App Development) with titles, descriptions, features, icons, and image paths.",
  "frontend/src/hooks/useActiveSection.ts": "Custom hook that uses IntersectionObserver to track which section is currently visible in the viewport and returns the active section ID as a hash string.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom hook that animates a counter from 0 to a target number over a specified duration using requestAnimationFrame for smooth transitions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that wraps IntersectionObserver to detect when a referenced element enters the viewport, returning a boolean intersection state with configurable threshold and rootMargin.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that calculates a parallax scroll offset by multiplying window scroll position by a speed factor, returning the offset value for parallax effects.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks that would interact with the backend; currently exports nothing as no backend queries are needed for the static website.",
  "frontend/src/hooks/useRippleEffect.ts": "Custom hook that creates a Material Design-style ripple effect on button clicks by dynamically creating and animating a span element at the click position.",
  "frontend/src/hooks/useSectionAnimation.ts": "Custom hook using IntersectionObserver to trigger fade-in and translateY animations when sections enter the viewport, with configurable threshold, rootMargin, and animation delay.",
  "frontend/src/hooks/useServicePanel.ts": "Custom hook managing the state of a service detail panel, providing open/close functions and tracking the currently active service with delayed cleanup for exit animations.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind configuration, CSS custom properties for a dark neon-cyan theme, utility classes for glass/neon effects, animations (grid-move, float, pulse-glow), and responsive typography with Orbitron and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/utils/scrollHelpers.ts": "Utility functions for smooth scrolling to elements with offset compensation, triggering highlight effects via custom events, and combining scroll-to-section with optional highlighting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (neon-cyan, electric-blue, dark-bg), font families (Orbitron, Inter), border radius variables, and accordion animations with plugins for animate and typography.",
  "project_state.json": "Project state tracking file documenting implemented features including navigation fixes, section IDs (home, services, about, contact), eagle logo with electric blue neon glow effects, animations, and hover interactions with GPU-accelerated CSS."
}