{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enhance eagle logo entry animation with head-activated neon glow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement head-first power-on animation for the eagle logo where neon energy originates from the eagle head and instantly spreads across the full logo during entry",
      "acceptanceCriteria": [
        "Eagle logo animates with parent container transforms: opacity 0→1, scale 0.85→1, translateY 25px→0, duration 1-1.2s ease-out",
        "Neon glow is visible from the first frame of animation",
        "Glow originates from eagle head area and flows to wings and body"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EagleLogo.tsx",
          "operation": "modify",
          "description": "Replace existing fade-in animation with head-first power-on animation. Add parent container transform keyframes for opacity 0→1, scale 0.85→1, translateY 25px→0 over 1-1.2s with ease-out timing. Ensure the animation maintains the existing sessionStorage tracking for one-time playback. Keep the circular container structure and hover interactions intact while integrating the new entry animation sequence."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply strongest electric blue neon glow on the eagle head and eyes that is visible from the first frame and creates the visual impression of an energy source",
      "acceptanceCriteria": [
        "Head and eyes have brightest neon glow intensity",
        "Glow exists before animation begins (not animated from zero opacity)",
        "Visual hierarchy establishes head as the power source"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EagleLogo.tsx",
          "operation": "modify",
          "description": "Add pre-rendered neon glow effect to the eagle head and eyes region using CSS filters and box-shadow with electric blue color. Apply the strongest glow intensity to establish the head as the energy source. Ensure glow is visible immediately when the component mounts (before animation starts) by applying static styles rather than animating from zero opacity. Layer the glow effects to create visual hierarchy with the head being the brightest region."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create smooth energy spread effect that flows from head to wings to full body over 0.4-0.6 seconds with subtle light propagation, avoiding flashing or harsh transitions",
      "acceptanceCriteria": [
        "Glow propagation animation duration is 0.4-0.6 seconds",
        "Smooth transition from head→wings→body without sudden changes",
        "No flickering or harsh intensity jumps"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EagleLogo.tsx",
          "operation": "modify",
          "description": "Implement energy spread animation using CSS keyframes that creates a flowing glow effect from head→wings→body over 0.4-0.6 seconds. Use gradient masks or pseudo-elements with animation-delay to create sequential light propagation. Apply easing functions that ensure smooth transitions without harsh intensity changes or flickering. Coordinate the energy spread timing to occur during the parent container entry animation."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement three-layer neon glow system consisting of inner illumination inside eagle head, medium glow around outline, and soft outer ambient aura behind head",
      "acceptanceCriteria": [
        "Three distinct glow layers are visible",
        "Inner layer illuminates head interior",
        "Medium layer outlines the eagle shape",
        "Outer layer creates ambient aura effect"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EagleLogo.tsx",
          "operation": "modify",
          "description": "Create a three-layer glow system using multiple CSS box-shadow declarations and pseudo-elements. Layer 1: Inner illumination using inset shadow or filter brightness on the head region. Layer 2: Medium glow around the eagle outline using standard box-shadow with moderate spread. Layer 3: Soft outer ambient aura using large blur radius box-shadow or backdrop blur positioned behind the head. Stack the layers with appropriate z-index and opacity values to achieve depth."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add cinematic light bloom burst at the eagle head when animation starts, with optional subtle shimmer sweep across wings once",
      "acceptanceCriteria": [
        "Light bloom effect appears at head at animation start",
        "Bloom is short and non-intrusive",
        "Optional shimmer sweep executes once across wings"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EagleLogo.tsx",
          "operation": "modify",
          "description": "Add a short-duration light bloom burst effect at the eagle head using a CSS animation with scale and opacity transforms. Position a pseudo-element at the head region that expands and fades out over 0.3-0.5 seconds at animation start. Optionally add a shimmer sweep animation using a linear gradient that moves across the wings once with animation-iteration-count set to 1. Ensure bloom and shimmer use GPU-accelerated properties only."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "After entry animation completes, stabilize glow into continuous soft breathing pulse with the head remaining slightly brighter than the rest of the eagle",
      "acceptanceCriteria": [
        "Continuous breathing pulse animation after entry completes",
        "Head maintains higher brightness than wings and body",
        "Pulse is subtle and does not distract"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EagleLogo.tsx",
          "operation": "modify",
          "description": "Implement a continuous breathing pulse animation using CSS keyframes that modulates glow intensity with a gentle ease-in-out rhythm. Set animation to loop infinitely with animation-iteration-count: infinite and a duration of 2-3 seconds. Maintain differential brightness by applying stronger base glow to the head region and weaker glow to wings/body. Use animation-delay to coordinate pulse start after entry animation completes. Keep pulse amplitude subtle to avoid distraction."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Use GPU-accelerated transform animations only, do not animate glow opacity from zero, and ensure glow exists before animation begins for optimal performance",
      "acceptanceCriteria": [
        "All animations use CSS transform properties",
        "Glow is pre-rendered before animation starts",
        "No opacity animations starting from zero for glow effects"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EagleLogo.tsx",
          "operation": "modify",
          "description": "Audit all animation implementations to ensure exclusive use of GPU-accelerated properties (transform, opacity on parent containers only, will-change hints). Apply glow effects as static styles that are present from the first render, avoiding any opacity: 0 → 1 animations on glow layers. Use transform-based animations (scale, translate) for motion effects. Add will-change: transform to animated elements to optimize rendering performance. Ensure all glow layers have initial opacity > 0."
        }
      ]
    }
  ]
}